WebSite/GFast/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $guitarras = Guitarras::find()->where(['gui_inativo' => 0])->orderBy('gui_id desc')->limit(9)->all();

        $marcas = Marcas::find()->all();
        $categorias = Categoriaguitarra::find()->all();
---
SELECT * FROM `marcas`
SELECT * FROM `categoriaguitarra`

    public function actionAvaliacoes($id)
    {
        $avaliacoes = Avaliacoes::find()->where(['gui_inativo' => 0, 'ava_idguitarra' => $id])->all();
---
SELECT * FROM `guitarras` WHERE `gui_inativo`=0